controllers/AdminController.php

    public function actionIndex()
    {
        $query = Admin::find();

        $pagination = new Pagination([
            'defaultPageSize' => 5,
            'totalCount' => $query->count(),
        ]);

        $admins = $query->orderBy('user')
            ->offset($pagination->offset)
            ->limit($pagination->limit)
            ->all();
---
SELECT COUNT(*) FROM `tbl_admin`
SELECT * FROM `tbl_admin` ORDER BY `user` LIMIT 5

    public function actionCreate()
    {
        $model = new Admin();
        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
INSERT INTO `tbl_admin` (`user`, `password`) VALUES ('user2', 'pass2')

    public function actionUpdate($id)
    {
        $model = Admin::findOne($id);
        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
SELECT * FROM `tbl_admin` WHERE `id`='1'
UPDATE `tbl_admin` SET `password`='pass_1' WHERE `id`=1

    public function actionDelete($id)
    {
        Admin::findOne($id)->delete();
---
DELETE FROM `tbl_admin` WHERE `id`=1
SELECT * FROM `tbl_admin` WHERE `id`='1'

    public function actionView($id)
    {
        $model = Admin::findOne($id);
---
SELECT * FROM `tbl_admin` WHERE `id`='2'